
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мвв_ДСП
	Движения.мвв_ДСП.Записывать = Истина;
	Движение = Движения.мвв_ДСП.Добавить();
	Движение.Период = Дата;
	Движение.Договор = ДокументОснование;
	Движение.ВариантВступленияВСилу = ДокументОснование.ВариантВступленияВСилу;
	Движение.ДатаНачалаОтветственности = ДатаНачалаОтветственности;
	Движение.ДатаОкончанияОтветственности = ДатаОкончанияОтветственности;
	Движение.Срок = Срок;
	Движение.Страхователь = Страхователь;
	Движение.ВерсияПродукта = ВерсияПродукта;
	Движение.ВалютаДоговора = ВалютаДоговора;
	Движение.КурсВалюты = КурсВалюты;
	Движение.КратностьВалюты = КратностьВалюты;

	// регистр мвв_ОбъектыИРиски
	Движения.мвв_ОбъектыИРиски.Записывать = Истина;
	Для Каждого ТекСтрокаОбъектыИРиски Из ОбъектыИРиски Цикл
		Движение = Движения.мвв_ОбъектыИРиски.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ДокументОснование;
		Движение.Объект = ТекСтрокаОбъектыИРиски.Объект;
		Движение.Риск = ТекСтрокаОбъектыИРиски.Риск;
		Движение.Валюта = ВалютаДоговора;
		Движение.СтраховаяСумма = ТекСтрокаОбъектыИРиски.СтраховаяСумма;
		Движение.СтраховаяПремия = ТекСтрокаОбъектыИРиски.СтраховаяПремия;
		Движение.ТипФраншизы = ТекСтрокаОбъектыИРиски.ТипФрнашизы;
		Движение.СуммаФраншизы = ТекСтрокаОбъектыИРиски.СуммаФраншизы;
	КонецЦикла;

	// регистр мвв_ГрафикПлатежей
	Движения.мвв_ГрафикПлатежей.Записывать = Истина;
	Для Каждого ТекСтрокаГрафикПлатежей Из ГрафикПлатежей Цикл
		Движение = Движения.мвв_ГрафикПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ДокументОснование;
		Движение.ДатаОплаты = ТекСтрокаГрафикПлатежей.ДатаОплаты;
		Движение.СуммаОплаты = ТекСтрокаГрафикПлатежей.Сумма;
	КонецЦикла;

	// регистр мвв_Водители
	Движения.мвв_Водители.Записывать = Истина;
	Для Каждого ТекСтрокаВодители Из Водители Цикл
		Движение = Движения.мвв_Водители.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ДокументОснование;
		Движение.Водитель = ТекСтрокаВодители.Контрагент;
		Движение.ДокументВУ = ТекСтрокаВодители.ДокументВУ;
		Движение.Возраст = ТекСтрокаВодители.Возраст;
		Движение.Стаж = ТекСтрокаВодители.Стаж;
	КонецЦикла;

	// регистр мвв_Посредники
	Движения.мвв_Посредники.Записывать = Истина;
	Для Каждого ТекСтрокаПосредники Из Посредники Цикл
		Движение = Движения.мвв_Посредники.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ДокументОснование;
		Движение.Посредник = ТекСтрокаПосредники.Посредник;
		Движение.ПроцентКомиссии = ТекСтрокаПосредники.ПроцентКВ;
		Движение.СуммаКомиссии = ТекСтрокаПосредники.СуммаКВ;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.мвв_ДСП") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Дата, Номер, Проведен");
	КонецЕсли;
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
	Для каждого сТЧ ИЗ Метаданные.Документы.мвв_ДСП.ТабличныеЧасти Цикл
		Для каждого тСтрока ИЗ ДанныеЗаполнения[сТЧ.Имя] Цикл
			тНовСтрока = ЭтотОбъект[сТЧ.Имя].Добавить();
			ЗаполнитьЗначенияСвойств(тНовСтрока, тСтрока);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

