
// Проверяет сущестуют ли ссылки по этому риску
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   Булево   – да/нет
//
Функция ПроверитьСуществуютСсылки() Экспорт
	
	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭлементРасчета", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭлементРасчета
	|ИЗ
	|	Справочник.ус_ТаблицыСтруктурыТарифа
	|ГДЕ
	|	ЭлементРасчета = &ЭлементРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭлементРасчета
	|ИЗ
	|	Справочник.ус_ЭлементыРасчетаТарифов.БазовыеЭлементыРасчета
	|ГДЕ
	|	ЭлементРасчета = &ЭлементРасчета
	|
	|";
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // ПроверитьСуществуютСсылки()
