
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мвв_ДСП
	Движения.мвв_ДСП.Записывать = Истина;
	Движение = Движения.мвв_ДСП.Добавить();
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
	Движение.ВариантВступленияВСилу = ВариантВступленияВСилу;
	Движение.ДатаНачалаОтветственности = ДатаНачалаОтветственности;
	Движение.ДатаОкончанияОтветственности = ДатаОкончанияОтветственности;
	Движение.Срок = Срок;
	Движение.Статус = Статус;
	Движение.Страхователь = Страхователь;
	Движение.ВерсияПродукта = ВерсияПродукта;
	Движение.ВалютаДоговора = ВалютаДоговора;
	Движение.КурсВалюты = КурсВалюты;
	Движение.КратностьВалюты = КратностьВалюты;

	// регистр мвв_ОбъектыИРиски
	Движения.мвв_ОбъектыИРиски.Записывать = Истина;
	Для Каждого ТекСтрокаОбъектыИРиски Из ОбъектыИРиски Цикл
		Движение = Движения.мвв_ОбъектыИРиски.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.Объект = ТекСтрокаОбъектыИРиски.Объект;
		Движение.Риск = ТекСтрокаОбъектыИРиски.Риск;
		Движение.Валюта = ВалютаДоговора;
		Движение.СтраховаяСумма = ТекСтрокаОбъектыИРиски.СтраховаяСумма;
		Движение.СтраховаяПремия = ТекСтрокаОбъектыИРиски.СтраховаяПремия;
		Движение.ТипФраншизы = ТекСтрокаОбъектыИРиски.ТипФрнашищы;
		Движение.СуммаФраншизы = ТекСтрокаОбъектыИРиски.СуммаФраншизы;
	КонецЦикла;

	// регистр мвв_ГрафикПлатежей
	Движения.мвв_ГрафикПлатежей.Записывать = Истина;
	Для Каждого ТекСтрокаГрафикПлатежей Из ГрафикПлатежей Цикл
		Движение = Движения.мвв_ГрафикПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.ДатаОплаты = ТекСтрокаГрафикПлатежей.ДатаОплаты;
		Движение.СуммаОплаты = ТекСтрокаГрафикПлатежей.Сумма;
	КонецЦикла;

	// регистр мвв_Водители
	Движения.мвв_Водители.Записывать = Истина;
	Для Каждого ТекСтрокаВодители Из Водители Цикл
		Движение = Движения.мвв_Водители.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.Водитель = ТекСтрокаВодители.Контрагент;
		Движение.ДокументВУ = ТекСтрокаВодители.ДокументВУ;
		Движение.Возраст = ТекСтрокаВодители.Возраст;
		Движение.Стаж = ТекСтрокаВодители.Стаж;
	КонецЦикла;

	// регистр мвв_Посредники
	Движения.мвв_Посредники.Записывать = Истина;
	Для Каждого ТекСтрокаПосредники Из Посредники Цикл
		Движение = Движения.мвв_Посредники.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.Посредник = ОсновнойПосредник;
		Движение.ПроцентКомиссии = ТекСтрокаПосредники.ПроцентКВ;
		Движение.СуммаКомиссии = ТекСтрокаПосредники.СуммаКВ;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.мвв_ПредварительныйРасчет") Тогда
		Если ТекущаяДата() > ДанныеЗаполнения.ДействуетДо Тогда
			ОбщегоНазначения.СообщитьПользователю("Данный расчет устарел. Его необходимо пересчитать");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Дата, Номер, Проведен");
	КонецЕсли;  
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
	ЭтотОбъект.СтраховойПродукт	 = ЭтотОбъект.ВерсияПродукта.Владелец; 
	ЭтотОбъект.ПремияПоДокументу = ДанныеЗаполнения.СуммаПремии;
	Для каждого тСтрока ИЗ ДанныеЗаполнения.ДанныеДляРасчета Цикл
		тНовСтрока = ЭтотОбъект.СвойстваДоговора.Добавить();
		ЗаполнитьЗначенияСвойств(тНовСтрока, тСтрока);
		Если тСтрока.Свойство.Наименование = "Страхователь" Тогда
			ЭтотОбъект.Страхователь = тСтрока.ЗначениеСвойства;
		КонецЕсли;
		Если тСтрока.Свойство.Наименование = "Дата начала" Тогда
			ЭтотОбъект.ДатаНачалаОтветственности = тСтрока.ЗначениеСвойства;
		КонецЕсли;
		Если тСтрока.Свойство.Наименование = "Дата окончания" Тогда
			ЭтотОбъект.ДатаОкончанияОтветственности = тСтрока.ЗначениеСвойства;
		КонецЕсли;
	КонецЦикла;	 
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВалютаДоговора) Тогда
		ЭтотОбъект.ВалютаДоговора = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КурсВалюты) Тогда
		ЭтотОбъект.КурсВалюты = 1;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КратностьВалюты) тогда
		ЭтотОбъект.КратностьВалюты = 1;
	КонецЕсли;
КонецПроцедуры
