
// Процедура обработчик события ПередЗаписью
// Выводит диагностическое сообщение о регистрации изменений
//
Процедура ПередЗаписью(Отказ)
	
	// проверим на уникальность кода
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.мвв_РазделыСвойствОбъектов
	|ГДЕ
	|	Владелец = &Владелец И
	|	НазначениеСвойства = &НазначениеСвойства И
	|	Код = &Код И
	|	Ссылка <> &Ссылка 
	|";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		#Если Клиент Тогда
			
			Предупреждение("Код не уникален!");
			Отказ = Истина;
			
		#Иначе
			
			ОбщегоНазначения.СообщитьОбОшибке("Код не уникален!", Отказ);
			
		#КонецЕсли
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью(Отказ)
