
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Об = РеквизитФормыВЗначение("Объект");
	Если ЗначениеЗаполнено(Об.Ссылка) Тогда
		ЭлементОтбора = РазделыСвойств.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ЭлементОтбора.ЛевоеЗначение    	= Новый ПолеКомпоновкиДанных("Объект");
    	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
    	ЭлементОтбора.Использование		= Истина;
    	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    	ЭлементОтбора.ПравоеЗначение	= Об.Ссылка;
   	КонецЕсли;
КонецПроцедуры
