
&НаСервере
Процедура кнРассчитатьНаСервере()               
	Об = РеквизитФормыВЗначение("Объект");
	Об.РассчитатьПремиюНаСервере();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура кнРассчитать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ВерсияПродукта) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена версия продукта");
		Возврат;
	КонецЕсли;
	
	кнРассчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура кнЗаполнитьСвойстваНаСервере()
	Об = РеквизитФормыВЗначение("Объект"); 
	Об.ЗаполнитьСвойстваДляРасчета(); 
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура кнЗаполнитьСвойства(Команда)
	кнЗаполнитьСвойстваНаСервере();
КонецПроцедуры
