
Процедура ЗаполнитьСвойстваДляРасчета() Экспорт
	ЭтотОбъект.ДанныеДЛяРасчета.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВерсияПродукта) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнена версия продукта");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	мвв_НазначенияСвойствОбъектов.Свойство КАК Свойство,
	               |	мвв_НазначенияСвойствОбъектов.Раздел КАК Раздел,
	               |	мвв_НазначенияСвойствОбъектов.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.мвв_НазначенияСвойствОбъектов КАК мвв_НазначенияСвойствОбъектов
	               |ГДЕ
	               |	мвв_НазначенияСвойствОбъектов.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.ВерсияПродукта);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		тНовСтрока = ЭтотОбъект.ДанныеДЛяРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(тНовСтрока, Выборка);
	КонецЦикла;	
КонецПроцедуры  

Процедура РассчитатьПремиюНаСервере() Экспорт
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВерсияПродукта) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнена версия продукта");
		Возврат;
	КонецЕсли;
	
	Версия = ЭтотОбъект.ВерсияПродукта.ПолучитьОбъект();
	сИтог = Новый Структура();
	Попытка
		Версия.ВыполнитьПредварительныйРасчет(ЭтотОбъект.ДанныеДляРасчета.Выгрузить(), ЭтотОбъект.СтруктураРасчета, сИтог);
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Ошибка при выполнении расчета: "+ОписаниеОшибки());
	КонецПопытки;
	
	ЭтотОбъект.РасчетВыполнен 	= сИтог.РасчетВыполнен;
	ЭтотОбъект.СуммаПремии	  	= сИтог.СуммаПремии; 
	ЭтотОбъект.ДействуетДо		= сИТог.ДействуетДо;
КонецПроцедуры