/////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет сущестуют ли ссылки по этому риску
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   Булево   – да/нет
//
Функция ПроверитьСуществуютФакторыТарифов() Экспорт


КонецФункции // ПроверитьСуществуютФакторыТарифов()

// Проверяет сущестуют ли ссылки по этому риску
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   Булево   – да/нет
//
Функция ПроверитьСуществуютФакторыВыплат() Экспорт


КонецФункции // ПроверитьСуществуютФакторыВыплат()

// Функция ищет калькулятор данной версии
//
// Параметры
//   Нет
// Возвращаемое значение:
//   СправочникСсылка.ус_ШаблоныКалькулятораПродуктовДСП – калькулятор
//
Функция НайтиКалькулятор() Экспорт
	
	
КонецФункции // НайтиКалькулятор()

// Процедура копирует подчиненных справочника
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура КопироватьПодчиненных(ОбъектКопирования) Экспорт

		    
КонецПроцедуры // КопироватьПодчиненных()
 

Функция ВыполнитьПредварительныйРасчет(тзДанныеДляРасчета, тзРезультат, сИтог) Экспорт
	Если Не ЗначениеЗаполнено(ЭтотОбъект.СпособРасчетаТарифа) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не задан расчет для версии продукта. РНеобходимо осуществить заполнение премии вручную");
		Возврат ЛОЖЬ;
	КонецЕсли;  
		
	тзНастройкиРасчета = ЭтотОбъект.СтруктураТарифа;
	сИтог.Вставить("РасчетВыполнен", ЛОЖЬ);
	сИтог.Вставить("СуммаПремии", 0);      
	сИтог.Вставить("ДействуетДо", Дата(1, 1, 1));
	
	Выполнить(ЭтотОбъект.СпособРасчетаТарифа);
	
	
КонецФункции

/////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура обработчик события ПередЗаписью
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		// по срокам
		Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
			СтрокаСрок = "(проект)" ;
		Иначе
			СтрокаСрок = "от " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy");
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
				СтрокаСрок = СтрокаСрок + " по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		КонецЕсли;
	    // наименование
		Наименование = "№ " + Строка(Код) + " " + СтрокаСрок;
	КонецЕсли;
			
КонецПроцедуры // ПередЗаписью(Отказ)
